app/views/rounds/index.html.erb

SELECT  "circuits".* FROM "circuits" WHERE "circuits"."id" = ? LIMIT 1  [["id", 1]]
---
            <td><%= round.circuit.locality %></td>
            <td><%= round.circuit.country %></td>