app/controllers/rounds_controller.rb

  def index
    @rounds = Round.all
---
SELECT "rounds".* FROM "rounds"