app/controllers/tips_controller.rb

SELECT  "rounds".* FROM "rounds" WHERE "rounds"."id" = ? LIMIT 1  [["id", 10]]
---
  def index
    if params.has_key?(:round_id)
      @round = Round.find(params[:round_id])

INSERT INTO "tips" ("qly_tip_1", "qly_tip_2", "qly_tip_3", "race_tip_1", "race_tip_2", "race_tip_3", "race_tip_4", "race_tip_5", "race_tip_6", "race_tip_7", "race_tip_8", "race_tip_9", "race_tip_10", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @tip = Tip.new(white_listed_parameters)
    @tip.user_id = current_user.id
    @tip.round_id = round_id
    if @tip.save